<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>

___

<a href="https://lms.clarusway.com/mod/lesson/view.php?id=8514&pageid=8161"><img align="center" src="https://i.ibb.co/6Z5pQxD/lmss.png" alt="Open in Clarusway LMS" width="70" height="200" title="Open Clarusway Learning Management Sytem"></a>

<a href="https://github.com/clarusway/DS-DE-0322-Students/blob/main/3-%20Classes%26Labs/2-DAwPY/DAwPy_S10_(Working%20with%20Text%20%26%20Time%20Data).ipynb"><img align="left" src="https://i.ibb.co/n3HWyQX/github-logo.png" alt="Open in Clarusway GitHub" width="100" height="150" title="Open and Execute in Clarusway GitHub Repository"></a>

<a href="https://nbviewer.org/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S10_%28Working%20with%20Text%20and%20Time%20Data%29/DAwPy-S10%20%28Working%20with%20Text%20and%20Time%20Data%29.ipynb"><img align="right" src="https://i.ibb.co/48wtV8c/nbviewer-badge.png" alt="Open in nbviewer" width="130" height="200" title="Open and Execute in nbviewer"></a><br/>
___

<a href="https://clarusway.com/"><img align="center" src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" alt="CLRSWY" width="450" height="200" title="Welcome to Place Where You can Reinvent Yourself"></a><br/>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:120%; text-align:center; border-radius:10px 10px;">Way to Reinvent Yourself</p>

<p style="text-align: center;"><img src="https://i.ibb.co/99DQ3TY/DS-Courses.png" class="img-fluid" 
alt="CLRSWY"></p>


<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 10</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Working with Text & Time Data</p>

<img src=https://i.ibb.co/X8TY4jf/Working-Pandaas.png width="700" height="200">

[Image Credit](https://medium.com/jbennetcodes/dealing-with-datetimes-like-a-pro-in-pandas-b80d3d808a7f)

Raw text data often comes in a form that makes analysis difficult. As such, it often requires text processing methods. Text processing is the practice of automating the generation and manipulation of text. It can be used for many data manipulation tasks including feature engineering from text, data wrangling, web scraping, search engines and much more.

Data wrangling including removal, extraction, replacement and conversion. is the process of gathering and transforming data to address an analytical question. It‚Äôs also often the most important and time-consuming step of the entire data science pipeline. In this process, you can also use Pandas to replace words or phrases with more informative or useful text.

Today, using the basic Pandas tools and skills,  we‚Äôll look at how to perform extraction from text as well as conversion of string values into time stamps or generating the type of clean and interpretable text data that allows for insights [Source](https://builtin.com/data-science/data-wrangling-pandas).

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [WORKING WITH TEXT DATA](#0)
* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#00)
* [WORKING WITH TIME DATA](#1)
    * [String Methods](#1.1)
    * [Most Usefull String Methods](#1.2)
    * [Dummy Operations](#1.3)
* [WORKING WITH TIME DATA](#2)
    * [pd.to_datetime()](#2.1)
    * [Series.dt()](#2.2)
    * [Datetime Module](#2.3)
    * [Series.dt()](#2.4)
* [DATE EXERCISE WITH DATETIME OBJECT FOR STUDENTS](#3)
* [THE END OF THE SESSION](#4)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="00"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [233]:
import numpy as np
import pandas as pd
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")  # to suppress all warnings

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Text Data</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>


Pandas cannot only include text data as an object, it also includes any other data that pandas don‚Äôt understand. This means, if you say when a column is an Object dtype, and it doesn‚Äôt mean all the values in that column will be a string or text data. In fact, they may be numbers, or a mixture of string, integers, and floats dtype. So with this incompatibility, we can not do any string operations on that column directly. Due to this problem, string dtype is introduced from the pandas 1.0 version, but we need to define it explicitly for applying string functions.

**üßê [Pandas provides a set of string functions](https://pandas.pydata.org/docs/user_guide/text.html)** which make it easy to operate on string data. Most importantly, these functions ignore (or exclude) missing/NaN values. Almost, all of these methods work with Python string functions **üßê [Refer To Official Python Documentation]( https://docs.python.org/3/library/stdtypes.html#string-methods)**. So, while studying with the Series Object, convert it to String Object and then perform the operation.

To sum up, before pandas 1.0, only ‚Äúobject‚Äù datatype was used to store strings which cause some drawbacks because non-string data can also be stored using ‚Äúobject‚Äù datatype. Pandas 1.0 introduces a new datatype specific to string data which is StringDtype. According to **üßê [Pandas Official Document](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)**, there are two ways to store text data in pandas:
- **Object -dtype NumPy array** (Object data type has a broader scope and allows to store pretty much anything).
- **StringDtype extension type**

**``One important thing``** to note here is that **object datatype is still the default datatype for strings**. To use StringDtype, we need to explicitly state it. Pandas recommend using StringDtype to store text data. However, ‚ÄúString‚Äù data type is not superior to ‚Äúobject‚Äù in terms of performance as of now **üßê [SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html), [SOURCE02](https://www.w3schools.com/python/python_ref_string.asp)**. 

**üßê [Why We Need to Use Pandas New String Dtype Instead of Object for Textual Data](https://towardsdatascience.com/why-we-need-to-use-pandas-new-string-dtype-instead-of-object-for-textual-data-6fd419842e24)**

**üßê [How do StringDtype objects differ from object dtype in Python Pandas?](https://www.tutorialspoint.com/how-do-stringdtype-objects-differ-from-object-dtype-in-python-pandas)**

**üßê [Pandas distinction between str and object types](https://stackoverflow.com/questions/34881079/pandas-distinction-between-str-and-object-types)**

### Distinction between str and object types

Numpy's string dtypes aren't python strings. Therefore, pandas deliberately uses native python strings, which require an object dtype.

In [234]:
import numpy as np

x = np.array(['Testing', 'a', 'string'], dtype='U7')
y = np.array(['Testing', 'a', 'string'], dtype=object)

x, y

(array(['Testing', 'a', 'string'], dtype='<U7'),
 array(['Testing', 'a', 'string'], dtype=object))

Now, ``'x'`` is a numpy string dtype (fixed-width, c-like string) and ``'y'`` is an array of native python strings.

If we try to go beyond 7 characters, we'll see an immediate difference. The Numpy string dtype versions will be truncated:

In [235]:
x[1] = 'a really really really long'
x

array(['Testing', 'a reall', 'string'], dtype='<U7')

The 'U' Unicode string can't hold Unicode dtype strings properly, though there is a unicode fixed-length string dtype, as well.

In [236]:
y[1] = 'a really really really long'
y

array(['Testing', 'a really really really long', 'string'], dtype=object)

For all of these reasons, pandas chose not to ever allow C-like, fixed-length strings as a datatype. As you noticed, attempting to coerce a python string into a fixed-with numpy string won't work in pandas. Instead, it always uses native python strings, which behave in a more intuitive way for most users.

In this notebook, we will first discuss the **üßê [string operations](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm)** with our basic Series/Index and learn how to apply these string functions on the DataFrame.

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">String Methods</p>

<a id="1.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Strings implement all of the common sequence operations, along with the additional methods described at **üßê [the official documentation](https://docs.python.org/3/library/stdtypes.html#string-methods)**.

Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (Please see the information about **üßê [str.format()](https://docs.python.org/3/library/stdtypes.html#str.format), [Format String Syntax](https://docs.python.org/3/library/string.html#formatstrings)** and **üßê [Custom String Formatting](https://docs.python.org/3/library/string.html#string-formatting))** and the other based on C printf style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle **üßê ([printf-style String Formatting](https://docs.python.org/3/library/stdtypes.html#old-string-formatting)**).

The **üßê [Text Processing Services](https://docs.python.org/3/library/text.html#textservices)** section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the **üßê [re](https://docs.python.org/3/library/re.html#module-re)** module).

Please watch **üßê [Video Source](https://www.youtube.com/watch?v=6JNwK6hEneg)** for enhancing your understanding of working with Text Data in Pandas.  

**What are these String Methods? Now let us examine some of the most common and usefull String Methods and dig into them one by one:**

In [237]:
dir(str)

['__add__',
 '__class__',
 '__contains__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getnewargs__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rmod__',
 '__rmul__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'capitalize',
 'casefold',
 'center',
 'count',
 'encode',
 'endswith',
 'expandtabs',
 'find',
 'format',
 'format_map',
 'index',
 'isalnum',
 'isalpha',
 'isascii',
 'isdecimal',
 'isdigit',
 'isidentifier',
 'islower',
 'isnumeric',
 'isprintable',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'ljust',
 'lower',
 'lstrip',
 'maketrans',
 'partition',
 'removeprefix',
 'removesuffix',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'split',
 'splitlines',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'zfill']

**üßê [dir(object)](https://docs.python.org/3/library/functions.html#dir)** is a powerful inbuilt function in Python3, which returns list of the attributes and methods of any object (say functions , modules, strings, lists, dictionaries etc.)

In [238]:
# !pip install xlrd
# !pip install lxml
# !pip install openpyxl

In [239]:
df = pd.read_excel("text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [240]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Most Usefull String Methods</p>

<a id="1.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- **[str.lower()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.lower.html) =>** Converts a string into lower case
- **[str.upper()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.upper.html) =>** Converts a string into upper case
- **[str.capitalize()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.capitalize.html) =>** Converts the first character to upper case
- **[str.title()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.title.html) =>** Converts the first character of each word to upper case
- **[str.swapcase()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.swapcase.html) =>** Swaps the case lower/upper

**üßê [SOURCE01](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm)
[SOURCE02](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas)
[SOURCE03](https://towardsdatascience.com/5-must-know-pandas-operations-on-strings-4f88ca6b8e25)
[SOURCE04](https://towardsdatascience.com/pandas-string-operations-explained-fdfab7602fb4)
[SOURCE05](https://blog.devgenius.io/string-operations-on-pandas-dataframe-88af220439d1)
[SOURCE06](https://www.geeksforgeeks.org/string-manipulations-in-pandas-dataframe/)**

___

**``str.lower()``** method returns a string where all characters are lower case.

In [241]:
df["staff"].str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smiÃáth
6      adrian star
7     albert simon
Name: staff, dtype: object

**``str.upper()``**  is used to convert strings in the Series/Index to uppercase.

In [242]:
df.staff.str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMƒ∞TH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

**``str.title()``** used to convert strings in the Series/Index to titlecase.

In [243]:
df.staff.str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar SmiÃáth
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

**``str.capitalize()``** is used to capitalize the string elements in Pandas Series.

In [244]:
df.staff.str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smiÃáth
6      Adrian star
7     Albert simon
Name: staff, dtype: object

**``str.swapcase()``** returns a string where all the upper case letters is converted to lower case and vice versa.

In [245]:
df.staff.str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smiÃáth
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

___

- **[str.isalpha()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.isalpha.html)     =>** Returns True if all characters in the string are in the alphabet
- **[str.isnumeric()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.isnumeric.html)   =>** Returns True if all characters in the string are numeric
- **[str.isalnum()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.isalnum.html)     =>** Returns True if all characters in the string are alphanumeric
- **[str.endswith()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.endswith.html)	  =>** Returns true if the string ends with the specified value
- **[str.startswith()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.startswith.html)  =>** Returns true if the string starts with the specified value
- **[str.contains()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.contains.html)    =>** Returns a Boolean value True for each element if the substring contains in the element, else False.

**üßê [SOURCE01](https://careerkarma.com/blog/python-isalpha-isnumeric-isalnum/)
[SOURCE02](https://careerkarma.com/blog/python-startswith-and-endswith/)
[SOURCE03](https://www.geeksforgeeks.org/python-startswith-endswidth-function/)
[SOURCE04](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.)**

___

In [246]:
# Let us remember our df

df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**isalpha()** Function in pandas python checks whether the string consists of ``alphabetic characters only``. It returns True when alphabetic value is present and it returns False when the alphabetic value is not present.

In [247]:
display(df.job)

df.job.str.isalpha()

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

**isnumeric()** checks whether all characters in each string are ``numeric``. This is equivalent to running the Python string method **str.isnumeric()** for each element of the Series/Index.

In [248]:
display(df.age)
print(type(df.age[0]))
df.age.str.isnumeric()

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

<class 'int'>

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [249]:
display(df.age)
print(type(df.age[0]))
df.age.str.isnumeric()

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

<class 'int'>

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [250]:
df.age.astype("string").str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: boolean

**isalnum()** Function in python checks whether the string consists of ``alphanumeric characters``. It returns True when alphanumeric value is present and it returns False when the alphanumeric value is not present. Alphanumeric means a character that is ``either a letter or a number``.

In [251]:
display(df.salary)

df.salary.str.isalnum()

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

Pandas **startswith()** tests if the start of each string element matches a pattern. It is yet another method to search and filter text data in Series or Data Frame. This method is Similar to Python‚Äôs startswith() method, but has different parameters and it works on Pandas objects only. Hence .str has to be prefixed everytime before calling this method, so that the compiler knows that it‚Äôs different from default function.

In [252]:
display(df.job)

df.job.str.startswith("d")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

Pandas **endswith()** method is a built-in function that determines whether the given string ends with a specific sequence of characters.

In [253]:
display(df.job)

df.job.str.endswith("per")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

The **contains()** method in Pandas allows you to search a column for a specific substring. The contains method returns boolean values for the Series with True for if the original Series value contains the substring and False if not **üßê [SOURCE](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.)**.

In [254]:
display(df.job)

df.job.str.contains("data")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [255]:
display(df.salary)

df.salary.str.contains("[a-z]+")

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

We can use these string methods which returning boolean expression for creating condition and so selecting relative rows:

In [256]:
df[df.job.str.contains("data")]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [257]:
df.loc[df.job.str.contains("data"), "department"]

2    IT
6    IT
7    IT
Name: department, dtype: object

In [258]:
df.loc[df.job.str.contains("data"), "department"] = "DS"
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

In [259]:
df.loc[df.job.str.contains("data"), "department"] = "IT"
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

___

- **[str.strip()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.lstrip.html)	=>** Returns a trimmed version of the string
- **[str.replace()](https://pandas.pydata.org/docs/reference/api/pandas.Series.replace.html) =>** Returns a string where a specified value is replaced with a specified value
- **[str.split()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html)	=>** Splits the string at the specified separator, and returns a list
- **[str.find()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.find.html)	=>** Searches the string for a specified value and returns the position of where it was found
- **[str.findall()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html)	=>** Returns a list of all occurrence of the pattern.
- **[str.join()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.join.html)	=>** Converts the elements of an iterable into a string

___

In [260]:
# Let's remember our df

df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**NOTE:** For a better using and understanding of strip, please revise escape characters in python **üßê [Source01 for Escape Characters](https://www.python-ds.com/python-3-escape-sequences) & [Source02 for Escape Characters](https://www.w3schools.com/python/gloss_python_escape_characters.asp)**

In [261]:
df.salary.str.strip("\"")

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [262]:
df.salary.str.strip('"')

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [263]:
df.salary.str.strip("\"").str.rstrip("dolar")

0    $150,000
1    $180,000
2    $150,000
3      130000
4    $110,000
5    $120,000
6    $135,000
7      125000
Name: salary, dtype: object

In [264]:
df.salary.str.strip("\"").str.rstrip("dolar").str.lstrip("$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [265]:
df.salary.str.strip("\"dolar$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [266]:
df.salary.str.strip("\"dolar$").str.replace(",", "")

# df.salary.str.strip("\"dolar$").replace(",", "") # "replace" method without "str" seeks specified character/characters as a full match

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [267]:
df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [268]:
df["salary"] = df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)
df.salary

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [269]:
df.age

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

In [270]:
print(df.age.dtype)
print(type(df.age[0]))
print(type(df.age[4]))

# print(df.age.dtype, type(df.age[0]), type(df.age[4]))

object
<class 'int'>
<class 'str'>

In [271]:
df.age.replace("-", np.nan)

#df.age.str.replace("-", np.nan) # gives an error

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [272]:
df["age"] = df.age.replace("-", np.nan)
df.age

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

### üî• Special Note: [``str.replace()``](https://pandas.pydata.org/docs/reference/api/pandas.Series.replace.html) vs [``.replace()``](https://www.programiz.com/python-programming/methods/string/replace) üî•

- **Purpose:** Use **str.replace** for substring replacements on a single string column, and **replace** for any general replacement on one or more columns.

- **Usage:** **str.replace** can replace one thing at a time. **replace** lets you perform multiple independent replacements, i.e., replace many things at once.

- **Default behavior:** **str.replace** enables regex replacement by default. **replace** only performs a full match unless the regex=True switch is used.

**replace()** works for string as well as non-string replacement. What's more, it is also meant to work for multiple columns at a time (you can access replace as a DataFrame method df.replace() as well, if you need to replace values across the entire DataFrame.

**üßê [What is the difference between Series.replace and Series.str.replace?](https://stackoverflow.com/questions/56625031/what-is-the-difference-between-series-replace-and-series-str-replace)**

**Series.str.split(pat=None, n=- 1, expand=False, *, regex=None)** **üßê [Source](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html)**
- Split strings around given separator/delimiter.
- Splits the string in the Series/Index from the beginning, at the specified delimiter string.

**string.split(separator, maxsplit)** **üßê [Source](https://docs.python.org/3/library/stdtypes.html#str.split)**
- Return a list of the words in the string, using sep as the delimiter string.

In [273]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMƒ∞TH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [274]:
display(df.staff.str.title().str.split().str[0])

df.staff.str.title().str.split().str.get(1)

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: staff, dtype: object

0      Blue
1     Black
2     Brown
3    Walker
4     Green
5    SmiÃáth
6      Star
7     Simon
Name: staff, dtype: object

**Indexing with** **``.str[ ]``** 

You can use **``[ ]``** notation to directly index by position locations **üßê [SOURCE](https://pandas.pydata.org/pandas-docs/version/0.15/text.html)**. 

**[pandas.Series.str.get](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.get.html)**

- Extract element from each component at specified position or with specified key.
- Extract element from lists, tuples, dict, or strings in each element in the Series/Index.

In [275]:
df["first_name"] = df.staff.str.title().str.split().str[0]
df["last_name"] = df.staff.str.title().str.split().str.get(1)
df.drop("staff", axis=1, inplace=True)

In [276]:
df

      id department                 job    salary   age first_name last_name
0  M0001         HR             manager  150000.0  52.0        Tom      Blue
1  M0002         IT             manager  180000.0  48.0       John     Black
2  E0001         IT      data scientist  150000.0  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000.0  38.0      Jason    Walker
4  E0003         IT   backend developer  110000.0   NaN       Alex     Green
5  E0004         IT  frontend developer  120000.0  32.0      Oscar    SmiÃáth
6  E0005         IT      data scientist  135000.0  40.0     Adrian      Star
7  E0006         IT      data scientist  125000.0  35.0     Albert     Simon

In [277]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

**str.find** returns ``lowest indexes`` in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.find().

**str.rfind** returns ``highest indexes`` in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.rfind().

In [278]:
df.job.str.find("developer")

0   -1
1   -1
2   -1
3   -1
4    8
5    9
6   -1
7   -1
Name: job, dtype: int64

In [279]:
df.job.str.rfind("data")

0   -1
1   -1
2    0
3   -1
4   -1
5   -1
6    0
7    0
Name: job, dtype: int64

In [280]:
#find, rfind farki
a = "Bana Alman diyarƒ±ndan bir Alman getirin Alman"
print(a.find("Alman"))
print(a.rfind("Alman"))

5
40

**str.findall** finds ``all occurrences`` of pattern or regular expression in the Series/Index **üßê [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html)**.

In [281]:
display(df.job)
df.job.str.findall("developer")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0             []
1             []
2             []
3             []
4    [developer]
5    [developer]
6             []
7             []
Name: job, dtype: object

In [282]:
display(df.job)
df.job.str.findall("d")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0        []
1        []
2       [d]
3        []
4    [d, d]
5    [d, d]
6       [d]
7       [d]
Name: job, dtype: object

In [283]:
# Let's add new features named "skils" and "Skills" to our DataFrame

df["skills"] = [[], ["Java", "C++"], ["Python", "Tableau", "SQL"], [], ["React", "Django"], ["JavaScript", "Python"], ["R", "SQL"], ["SQL", "Python"]]
df["Skills"] = [[], [], ["Python","Tableau","SQL"], [], ["React", "Django"], ["JavaScript", "Python"], ["R", "SQL"], ["SQL", "Python"]]
df.loc[1, "Skills"] = "Java, C++"
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,SmiÃáth,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

If the elements of a Series are ``lists`` themselves, join the content of these lists using the delimiter passed to the function. This function is an equivalent to str.join() **üßê [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.join.html)**.

**Join** lists contained as elements in the Series/Index with passed delimiter.

In [284]:
df.skills.str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [285]:
df.Skills.str.join(",")

0
1     J,a,v,a,,, ,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [286]:
df.Skills.apply(lambda item: ",".join(item) if type(item) == list else item)

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [287]:
[",".join(item) if type(item) == list else item for item in df.Skills]

['',
 'Java, C++',
 'Python,Tableau,SQL',
 '',
 'React,Django',
 'JavaScript,Python',
 'R,SQL',
 'SQL,Python']

In [288]:
df["Skills"] = [",".join(item) if type(item) == list else item for item in df.Skills]
df.Skills

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [289]:
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,SmiÃáth,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Dummy Operations</p>

<a id="1.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A dataset may contain various type of values, sometimes it consists of categorical values. So, in-order to use those categorical value for programming efficiently we create dummy variables. A dummy variable is a binary variable that indicates whether a separate categorical variable takes on a specific value **üßê [SOURCE](https://www.geeksforgeeks.org/how-to-create-dummy-variables-in-python-with-pandas/)**.

### get_dummies()

**Syntax1:** ``pd.get_dummies(data, prefix=None, prefix_sep="_",)``<br>
            **OR**<br>
**Syntax2:** ``df["col_name"].get_dummies(sep = ",")``

**Parameters:**
- data= input data i.e. it includes pandas data frame. list . set . numpy arrays etc.
- prefix= Initial value
- prefix_sep= Data values separation.
- Return Type: Dummy variables.

In [290]:
display(df.department)
display(df.department.unique())
pd.get_dummies(df.department)

0    HR
1    IT
2    IT
3    HR
4    IT
5    IT
6    IT
7    IT
Name: department, dtype: object

array(['HR', 'IT'], dtype=object)

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

As you can see two(2) dummy variables are created for the three categorical values of the "department" attribute. We can create dummy variables in python using **``get_dummies()``** method.

Dummies with **``drop_first=True``** parameter can be used to drop the first column. drop_first=True is important to use, as it helps in reducing the extra column created during dummy variable creation. Hence it reduces the correlations created among dummy variables. In other words it drops the first dummy to avoid the creation of correlated features **üßê [SOURCE](https://stackoverflow.com/questions/63661560/drop-first-true-during-dummy-variable-creation-in-pandas#:~:text=1%20Answer,correlations%20created%20among%20dummy%20variables.)**.

In [291]:
pd.get_dummies(df.department, drop_first=True)

   IT
0   0
1   1
2   1
3   0
4   1
5   1
6   1
7   1

In [292]:
df.Skills

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [293]:
df.Skills.str.get_dummies(sep=",")

    C++  Django  Java  JavaScript  Python  R  React  SQL  Tableau
0     0       0     0           0       0  0      0    0        0
1     1       0     1           0       0  0      0    0        0
2     0       0     0           0       1  0      0    1        1
3     0       0     0           0       0  0      0    0        0
4     0       1     0           0       0  0      1    0        0
5     0       0     0           1       1  0      0    0        0
6     0       0     0           0       0  1      0    1        0
7     0       0     0           0       1  0      0    1        0

In [294]:
df.Skills.str.get_dummies(sep=",").add_prefix("Skills_")

,Skills_ C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau
0,0,0,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0
2,0,0,0,0,1,0,0,1,1
3,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,1,0,0
5,0,0,0,1,1,0,0,0,0
6,0,0,0,0,0,1,0,1,0
7,0,0,0,0,1,0,0,1,0

In [295]:
skills_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("Skills_")

In [296]:
df_final = df[["department", "job", "salary", "Skills"]]
df_final

  department                 job    salary              Skills
0         HR             manager  150000.0
1         IT             manager  180000.0           Java, C++
2         IT      data scientist  150000.0  Python,Tableau,SQL
3         HR           recruiter  130000.0
4         IT   backend developer  110000.0        React,Django
5         IT  frontend developer  120000.0   JavaScript,Python
6         IT      data scientist  135000.0               R,SQL
7         IT      data scientist  125000.0          SQL,Python

In [297]:
df_final.join(skills_dummy)

,department,job,salary,Skills,Skills_ C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau
0,HR,manager,150000.0,,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,"Java, C++",1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,"Python,Tableau,SQL",0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,"React,Django",0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,"JavaScript,Python",0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,"R,SQL",0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,"SQL,Python",0,0,0,0,1,0,0,1,0

In [298]:
df_final = df_final.join(skills_dummy)
df_final.drop("Skills", axis=1, inplace=True)

In [299]:
df_final

,department,job,salary,Skills_ C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau
0,HR,manager,150000.0,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,0,0,0,0,1,0,0,1,0

In [300]:
pd.get_dummies(df_final, drop_first=True)

,salary,Skills_ C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,180000.0,1,0,1,0,0,0,0,0,0,1,0,0,1,0
2,150000.0,0,0,0,0,1,0,0,1,1,1,1,0,0,0
3,130000.0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,110000.0,0,1,0,0,0,0,1,0,0,1,0,0,0,0
5,120000.0,0,0,0,1,1,0,0,0,0,1,0,1,0,0
6,135000.0,0,0,0,0,0,1,0,1,0,1,1,0,0,0
7,125000.0,0,0,0,0,1,0,0,1,0,1,1,0,0,0

In [301]:
df_final = pd.get_dummies(df_final, drop_first = True)
df_final

,salary,Skills_ C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,180000.0,1,0,1,0,0,0,0,0,0,1,0,0,1,0
2,150000.0,0,0,0,0,1,0,0,1,1,1,1,0,0,0
3,130000.0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,110000.0,0,1,0,0,0,0,1,0,0,1,0,0,0,0
5,120000.0,0,0,0,1,1,0,0,0,0,1,0,1,0,0
6,135000.0,0,0,0,0,0,1,0,1,0,1,1,0,0,0
7,125000.0,0,0,0,0,1,0,0,1,0,1,1,0,0,0

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Time Data</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

As someone who works with time series data on almost a daily basis, it's clear that the pandas Python package is extremely useful for time series manipulation and analysis. This basic introduction to time series data manipulation with pandas should allow you to get started in your time series analysis. Specific objectives are to show you how to:
- create a date range
- work with timestamp data
- convert string data to a timestamp
- index and slice your time series data in a data frame
- resample your time series for different time period aggregates/summary statistics
- compute a rolling statistic such as a rolling average
- work with missing data
- understand the basics of unix/epoch time
- understand common pitfalls of time series data analysis **üßê [SOURCE](https://towardsdatascience.com/basic-time-series-manipulation-with-pandas-4432afee64ea)**

In this section, we will introduce how to work with each of these types of date/time data in Pandas. This short section is by no means a complete guide to the time series tools available in Python or Pandas, but instead is intended as a broad overview of how you as a user should approach working with time series **üßê [SOURCE](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html), [SOURCE](https://builtin.com/data-science/data-wrangling-pandas)**.

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">pd.to_datetime()</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

For more and detailed information about **to_datetime()** metod, please **üßê [Visit Official Document](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html)**

**``pd.to_datetime()``** Converts argument to datetime.

This function converts a **``scalar``**, **``array-like``**, **``Series``** or **``DataFrame/dict-like``** to a pandas datetime object.

**As stated above, many input types are supported, and lead to different output types:**

- **``scalars``** can be int, float, str, datetime object (from stdlib datetime module or numpy). They are converted to ``Timestamp`` when possible, otherwise they are converted to ``datetime.datetime``. None/NaN/null scalars are converted to NaT.

- **``array-like``** can contain int, float, str, datetime objects. They are converted to ``DatetimeIndex`` when possible, otherwise they are converted to ``Index with object dtype``, containing ``datetime.datetime``. None/NaN/null entries are converted to NaT in both cases.

- **``Series``** are converted to ``Series with datetime64 dtype`` when possible, otherwise they are converted to ``Series with object dtype``, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``DataFrame/dict-like``** are converted to ``Series with datetime64 dtype``. For each row a datetime is created from assembling the various dataframe columns. Column keys can be common abbreviations like [‚Äòyear‚Äô, ‚Äòmonth‚Äô, ‚Äòday‚Äô, ‚Äòminute‚Äô, ‚Äòsecond‚Äô, ‚Äòms‚Äô, ‚Äòus‚Äô, ‚Äòns‚Äô]) or plurals of the same.

**üßê [Special Note :](https://pandas.pydata.org/docs/getting_started/intro_tutorials/09_timeseries.html)**

As many data sets do contain datetime information in one of the columns, pandas input function like **üßê [pandas.read_csv()](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html#pandas.read_csv)** and **üßê [pandas.read_json()](https://pandas.pydata.org/docs/reference/api/pandas.read_json.html#pandas.read_json)** can do the transformation to dates when reading the data using the **``parse_dates parameter``** with a list of the columns to read as Timestamp.

Why are these **``pandas.Timestamp``** objects useful? Let's illustrate the added value with some example cases. In this sense, let us assume that we want to work with the dates in the column datetime as datetime objects instead of plain text:

In [302]:
# pd.read_csv("time_exercise.csv", parse_dates=["entry_date", "order_date"]

df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [303]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [304]:
df["order_date"]

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [305]:
# df.order_date.max() - df.order_date.min()

# TypeError: unsupported operand type(s) for -: 'str' and 'str'

Initially, the values in datetime are character strings and do **NOT** provide any datetime operations (e.g. extract the year, day of the week,‚Ä¶). By applying the **to_datetime()** function, pandas interprets the strings and convert these to datetime (i.e. ``datetime64[ns, UTC]``) objects. In pandas we call these datetime objects similar to datetime.datetime from the standard library as **üßê [pandas.Timestamp](https://pandas.pydata.org/docs/reference/api/pandas.Timestamp.html#pandas.Timestamp)**.

In [306]:
pd.to_datetime(df["order_date"])

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [307]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])

In [308]:
df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04

In [309]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

Now let's apply some aggregate methods for Datatime object at the given dataset:

In [310]:
df.entry_date.min()

Timestamp('2018-12-04 00:00:00')

In [311]:
df.entry_date.max()

Timestamp('2020-11-26 00:00:00')

In [312]:
df.entry_date.max() - df.entry_date.min()

Timedelta('723 days 00:00:00')

In [313]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [314]:
a.max()

'24-07-2018'

In [315]:
# a.max() - a.min()

# # Give an error of "TypeError: unsupported operand type(s) for -: 'str' and 'str'""

In [316]:
pd.to_datetime(a, format='%d-%m-%Y')

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

In [317]:
a = pd.to_datetime(a, format='%d-%m-%Y')
a

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

In [318]:
k = pd.to_datetime(a, format='%d-%m-%Y').max()
display(type(k))
k

pandas._libs.tslibs.timestamps.Timestamp

Timestamp('2020-03-15 00:00:00')

In [319]:
s = pd.to_datetime(a, format='%d-%m-%Y').min()
s

Timestamp('2018-07-24 00:00:00')

In [320]:
k - s

Timedelta('600 days 00:00:00')

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Series.dt</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Accessor object for datetimelike properties of the Series values **üßê [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html), [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html)**.

For a comprehensive information what the datetimelike properties, please visit **üßê [Official Pandas API Reference Document](https://pandas.pydata.org/pandas-docs/version/0.22/api.html#datetimelike-properties)**

In [321]:
df["entry_date"].dt.year 

# it can be date, year, quarter, month, week, day, weekday, dayofweek, hour, minute, second, microsecond

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int64

In [322]:
df.entry_date.dt.quarter

0      4
1      4
2      4
3      4
4      4
      ..
906    4
907    4
908    4
909    4
910    4
Name: entry_date, Length: 911, dtype: int64

In [323]:
df.entry_date.dt.dayofweek

0      1
1      1
2      1
3      1
4      1
      ..
906    2
907    2
908    4
909    1
910    3
Name: entry_date, Length: 911, dtype: int64

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Datetime Module</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

The datetime module supplies classes for manipulating dates and times **üßê [SOURCE](https://docs.python.org/3/library/datetime.html)**.

### üßê [``class datetime.datetime``](https://docs.python.org/3/library/datetime.html)

A combination of a date and a time. Attributes: year, month, day, hour, minute, second, microsecond, and tzinfo.

In [324]:
from datetime import datetime

In [325]:
datetime.now()

datetime.datetime(2023, 1, 4, 23, 6, 7, 303204)

In [326]:
print(datetime.now())

2023-01-04 23:06:07.319278

In [327]:
print(datetime.today())

2023-01-04 23:06:07.333358

In [328]:
current_datetime = datetime.now()

print(current_datetime)

2023-01-04 23:06:07.348576

In [329]:
current_datetime.date() 

# it can be date, year, month, day, weekday, isoweekday, hour, minute, second, microsecond, tzinfo

datetime.date(2023, 1, 4)

In [330]:
current_datetime.year

2023

In [331]:
current_datetime.weekday() 

# Return the day of the week as an integer, where Monday is 0 and Sunday is 6.

2

In [332]:
current_datetime.isoweekday() 

# Return the day of the week as an integer, where Monday is 1 and Sunday is 7.

3

### üßê [``class datetime.timedelta``](https://docs.python.org/3/library/datetime.html)

A duration expressing the difference between two date, time, or datetime instances to microsecond resolution [SOURCE](https://www.geeksforgeeks.org/manipulate-date-and-time-with-the-datetime-module-in-python/).

In [333]:
from datetime import timedelta

In [334]:
timedelta(days=2)

datetime.timedelta(days=2)

In [335]:
print(timedelta(days=2))

2 days, 0:00:00

In [336]:
current_datetime

datetime.datetime(2023, 1, 4, 23, 6, 7, 348576)

In [337]:
two_days_before = current_datetime - timedelta(days=2)
two_days_before

datetime.datetime(2023, 1, 2, 23, 6, 7, 348576)

In [338]:
current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10)

datetime.datetime(2023, 1, 22, 3, 16, 7, 348576)

In [339]:
print(f"{'current_date': <15}", current_datetime)

print(f"{'plus': <15}", timedelta(weeks=2, hours=4, minutes=10))

print(f"{'total': <15}", current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10))

current_date    2023-01-04 23:06:07.348576
plus            14 days, 4:10:00
total           2023-01-22 03:16:07.348576

### üßê [``strftime()``](https://docs.python.org/3/library/datetime.html)

**Converting** from date/datetime/timedelta object **to string type** **üßê [SOURCE](https://strftime.org/)**

In [340]:
current_datetime

datetime.datetime(2023, 1, 4, 23, 6, 7, 348576)

In [341]:
print(current_datetime)

2023-01-04 23:06:07.348576

In [342]:
current_datetime.year

2023

In [343]:
type(current_datetime.year)  # This is class datetime.datetime provided by Datetime Module

int

**Watch out the difference.**

In [344]:
current_datetime.strftime("%Y")  # This is a strftime(format) method provided by Datetime Module

'2023'

In [345]:
type(current_datetime.strftime("%Y"))

str

In [346]:
year = current_datetime.strftime("%Y")
print("year:", year)
print("year's type is:", type(year), "\n")

month = current_datetime.strftime("%m")
print("month:", month)
print("month's type is:", type(month), "\n")

day = current_datetime.strftime("%d")
print("day:", day)
print("day's type is:", type(day), "\n")

time = current_datetime.strftime("%H:%M:%S")
print("time:", time)
print("time's type is:", type(time), "\n")

date_time = current_datetime.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:", date_time)
print("date_time's type is:", type(date_time), "\n")

year: 2023
year's type is: <class 'str'>

month: 01
month's type is: <class 'str'>

day: 04
day's type is: <class 'str'>

time: 23:06:07
time's type is: <class 'str'>

date and time: 01/04/2023, 23:06:07
date_time's type is: <class 'str'>

### üßê [strptime()](https://docs.python.org/3/library/datetime.html)

**Converting** from string type **to datetime object**

In [347]:
date_string = "21 June, 2018"
date_string

'21 June, 2018'

In [348]:
datetime.strptime(date_string, "%d %B, %Y")

# datetime.strptime(date_string) # gives an error

datetime.datetime(2018, 6, 21, 0, 0)

In [349]:
pd.to_datetime(date_string)

Timestamp('2018-06-21 00:00:00')

In [350]:
datetime_object = datetime.strptime(date_string, "%d %B, %Y")
datetime_object

datetime.datetime(2018, 6, 21, 0, 0)

In [351]:
type(datetime_object)

datetime.datetime

In [352]:
datetime_object.year

2018

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Date Exercise with Datetime Object for Students</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

## Let's detect the time between first order date and entry date for each product

In [353]:
# Let's remember our df

df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]

In [354]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

**Let us do it by string methods**

In [355]:
df["order_date"] - df["entry_date"]

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]

In [356]:
df["time_delta"] = df["order_date"] - df["entry_date"]
df.head(3)

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96 days

In [357]:
df["time_delta"].astype("str").str.split(" ").str[0].astype(int)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [358]:
df["time_delta"] = df["time_delta"].astype("str").str.split(" ").str[0].astype(int)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10

In [359]:
df.groupby("id_product")["time_delta"].min()

id_product
401        781
416        485
717         96
778        388
826        442
          ...
1536841     38
1536842     48
1536887      9
1536952     63
1536974     10
Name: time_delta, Length: 498, dtype: int32

In [360]:
df.groupby("id_product")["time_delta"].transform(min)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [361]:
df["passing_time_to_firstsale"] = df.groupby("id_product")["time_delta"].transform(min)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442
...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10

In [362]:
df.sample(10)

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
211,3726,2020-01-17,1.0,407.988000,2018-12-04,409,337
660,11531,2020-11-11,1.0,315.061984,2018-12-04,708,708
535,6648,2020-02-07,1.0,309.421488,2018-12-04,430,430
547,6772,2020-10-26,1.0,312.644628,2018-12-04,692,420
720,13209,2020-05-16,1.0,734.580000,2018-12-04,529,529
96,3671,2020-02-06,1.0,222.314050,2018-12-04,429,230
442,5086,2020-08-06,1.0,452.760000,2018-12-04,611,257
377,4498,2020-03-05,1.0,226.149000,2018-12-04,457,457
764,1525104,2019-09-23,1.0,1641.666667,2018-12-04,293,102
374,4459,2020-06-03,1.0,336.586800,2018-12-04,547,547

In [363]:
df[(df.time_delta != df.passing_time_to_firstsale)]

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
15,1031,2018-12-16,1.0,234.990000,2018-12-04,12,-16
25,1410,2020-11-29,1.0,227.988000,2018-12-04,726,404
39,2051,2020-10-21,1.0,329.000000,2018-12-04,687,670
41,2065,2019-06-20,1.0,246.662350,2018-12-04,198,-17
43,2072,2019-07-03,1.0,189.737350,2018-12-04,211,185
...,...,...,...,...,...,...,...
898,1536753,2020-09-04,1.0,450.000000,2020-08-15,20,-38
899,1536753,2020-11-23,1.0,450.000000,2020-08-15,100,-38
900,1536753,2020-11-25,2.0,408.000000,2020-08-15,102,-38
904,1536841,2020-11-20,1.0,988.429752,2020-10-07,44,38
905,1536841,2020-11-22,1.0,988.429752,2020-10-07,46,38

In [364]:
df.groupby("id_product")["id_product"].count().sort_values(ascending=False)

id_product
3674       33
3671       21
3711       15
11364      13
1525105    13
           ..
4791        1
4745        1
4713        1
4699        1
1536974     1
Name: id_product, Length: 498, dtype: int64

In [131]:
df[(df.id_product == 3674)].sort_values("time_delta")

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
116,3674,2019-06-17,1.0,528.988500,2018-12-04,195,195
117,3674,2020-01-08,1.0,551.988000,2018-12-04,400,195
118,3674,2020-01-13,1.0,551.988000,2018-12-04,405,195
119,3674,2020-01-23,1.0,551.988000,2018-12-04,415,195
120,3674,2020-01-28,1.0,551.988000,2018-12-04,420,195
121,3674,2020-02-16,1.0,607.186800,2018-12-04,439,195
122,3674,2020-02-21,1.0,607.186800,2018-12-04,444,195
123,3674,2020-03-06,1.0,607.186800,2018-12-04,458,195
124,3674,2020-03-08,1.0,607.186800,2018-12-04,460,195
125,3674,2020-03-09,1.0,607.186800,2018-12-04,461,195
126,3674,2020-03-14,1.0,607.186800,2018-12-04,466,195
127,3674,2020-04-12,1.0,607.186800,2018-12-04,495,195
128,3674,2020-04-20,1.0,607.186800,2018-12-04,503,195
129,3674,2020-04-23,2.0,607.186800,2018-12-04,506,195
130,3674,2020-04-26,1.0,607.186800,2018-12-04,509,195
131,3674,2020-05-07,1.0,607.186800,2018-12-04,520,195
132,3674,2020-05-15,1.0,607.186800,2018-12-04,528,195
133,3674,2020-05-17,1.0,610.743802,2018-12-04,530,195
134,3674,2020-06-08,1.0,610.743802,2018-12-04,552,195
135,3674,2020-06-25,1.0,610.743802,2018-12-04,569,195
136,3674,2020-09-06,1.0,555.221638,2018-12-04,642,195
137,3674,2020-09-11,1.0,555.221638,2018-12-04,647,195
138,3674,2020-09-18,1.0,555.221638,2018-12-04,654,195
139,3674,2020-09-20,1.0,555.221638,2018-12-04,656,195
140,3674,2020-09-23,1.0,555.221638,2018-12-04,659,195
141,3674,2020-09-26,1.0,555.221638,2018-12-04,662,195
142,3674,2020-10-08,1.0,555.221638,2018-12-04,674,195
143,3674,2020-10-11,1.0,555.221638,2018-12-04,677,195
144,3674,2020-11-04,1.0,555.221638,2018-12-04,701,195
145,3674,2020-11-23,1.0,555.221638,2018-12-04,720,195
146,3674,2020-11-25,1.0,555.221638,2018-12-04,722,195
147,3674,2020-11-29,1.0,555.221638,2018-12-04,726,195
148,3674,2020-12-07,1.0,333.801653,2018-12-04,734,195

## Let's detect the time between last order date and today for each product

**This time, let us do it by datetime properties**

In [132]:
df.groupby("id_product").order_date.max()

id_product
401       2021-01-23
416       2020-04-02
717       2019-03-10
778       2019-12-27
826       2020-02-19
             ...
1536841   2020-11-22
1536842   2020-11-24
1536887   2020-11-22
1536952   2021-01-26
1536974   2020-12-06
Name: order_date, Length: 498, dtype: datetime64[ns]

In [133]:
df.groupby("id_product").order_date.transform(max).dt.date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [134]:
last_order_date = df.groupby("id_product").order_date.transform(max).dt.date

In [135]:
today = pd.to_datetime("27-02-2021", format='%d-%m-%Y').date()
print(today)

2021-02-27

In [136]:
today - last_order_date

0      35 days
1     331 days
2     720 days
3     428 days
4     374 days
        ...
906    95 days
907    95 days
908    97 days
909    32 days
910    83 days
Name: order_date, Length: 911, dtype: timedelta64[ns]

In [137]:
df["passing_time_from_lastsale"] = today - last_order_date

In [138]:
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,35 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,331 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,720 days
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,428 days
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,374 days
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95 days
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95 days
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,97 days
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,32 days
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,83 days

In [139]:
df["passing_time_from_lastsale"] = df["passing_time_from_lastsale"].astype("str").str.split(" ").str[0].astype(int)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,35
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,331
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,720
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,428
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,374
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,97
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,32
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,83

In [140]:
df[(df.id_product == 3674)].sort_values("time_delta")

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
116,3674,2019-06-17,1.0,528.988500,2018-12-04,195,195,82
117,3674,2020-01-08,1.0,551.988000,2018-12-04,400,195,82
118,3674,2020-01-13,1.0,551.988000,2018-12-04,405,195,82
119,3674,2020-01-23,1.0,551.988000,2018-12-04,415,195,82
120,3674,2020-01-28,1.0,551.988000,2018-12-04,420,195,82
121,3674,2020-02-16,1.0,607.186800,2018-12-04,439,195,82
122,3674,2020-02-21,1.0,607.186800,2018-12-04,444,195,82
123,3674,2020-03-06,1.0,607.186800,2018-12-04,458,195,82
124,3674,2020-03-08,1.0,607.186800,2018-12-04,460,195,82
125,3674,2020-03-09,1.0,607.186800,2018-12-04,461,195,82
126,3674,2020-03-14,1.0,607.186800,2018-12-04,466,195,82
127,3674,2020-04-12,1.0,607.186800,2018-12-04,495,195,82
128,3674,2020-04-20,1.0,607.186800,2018-12-04,503,195,82
129,3674,2020-04-23,2.0,607.186800,2018-12-04,506,195,82
130,3674,2020-04-26,1.0,607.186800,2018-12-04,509,195,82
131,3674,2020-05-07,1.0,607.186800,2018-12-04,520,195,82
132,3674,2020-05-15,1.0,607.186800,2018-12-04,528,195,82
133,3674,2020-05-17,1.0,610.743802,2018-12-04,530,195,82
134,3674,2020-06-08,1.0,610.743802,2018-12-04,552,195,82
135,3674,2020-06-25,1.0,610.743802,2018-12-04,569,195,82
136,3674,2020-09-06,1.0,555.221638,2018-12-04,642,195,82
137,3674,2020-09-11,1.0,555.221638,2018-12-04,647,195,82
138,3674,2020-09-18,1.0,555.221638,2018-12-04,654,195,82
139,3674,2020-09-20,1.0,555.221638,2018-12-04,656,195,82
140,3674,2020-09-23,1.0,555.221638,2018-12-04,659,195,82
141,3674,2020-09-26,1.0,555.221638,2018-12-04,662,195,82
142,3674,2020-10-08,1.0,555.221638,2018-12-04,674,195,82
143,3674,2020-10-11,1.0,555.221638,2018-12-04,677,195,82
144,3674,2020-11-04,1.0,555.221638,2018-12-04,701,195,82
145,3674,2020-11-23,1.0,555.221638,2018-12-04,720,195,82
146,3674,2020-11-25,1.0,555.221638,2018-12-04,722,195,82
147,3674,2020-11-29,1.0,555.221638,2018-12-04,726,195,82
148,3674,2020-12-07,1.0,333.801653,2018-12-04,734,195,82

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of Session - 10</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://i.ibb.co/99DQ3TY/DS-Courses.png" class="img-fluid" 
alt="CLRSWY"></p>

<a href="https://clarusway.com/"><img align="center" src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" alt="CLRSWY" title="Way to Reinvent Yourself"></a><br/>


## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:120%; text-align:center; border-radius:10px 10px;">Way to Reinvent Yourself</p>
___

<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>